# Case study 2

In [55]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [35]:
import pandas as pd
df = pd.read_csv('StudentsPerformance.csv')
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

## 1. Find out how many males and females participated in the test

In [32]:
df.gender.value_counts(sort=True).to_frame()

        gender
female     518
male       482

## 2. What do you think about the students' parental level of education?

In [2]:
import pandas as pd
df = pd.read_csv('StudentsPerformance.csv')
parent_education=df["parental level of education"].value_counts()
print (parent_education)

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

 There are 6 different classes of education among student's parent's education . In the pool of 1000 observation parents belong to college level of education is greater, and master's degree is the lowest.

## 3. Who scores the most on average for math, reading and writing based on
#Gender

In [44]:
df[['gender','math score']].groupby('gender').mean().sort_values('math score',ascending=False).head()

        math score
gender
male     68.821577
female   63.376448

In [45]:
df[['gender','reading score']].groupby('gender').mean().sort_values('reading score',ascending=False).head()

        reading score
gender
female      72.590734
male        65.545643

In [46]:
df[['gender','writing score']].groupby('gender').mean().sort_values('writing score',ascending=False).head()

        writing score
gender
female      72.467181
male        63.446058

## 3. Who scores the most on average for math, reading and writing based on
#test preparation course

In [47]:
df[['test preparation course','math score']].groupby('test preparation course').mean().sort_values('math score',ascending=False).head()

                         math score
test preparation course
completed                  69.96648
none                       63.78972

In [48]:
df[['test preparation course','reading score']].groupby('test preparation course').mean().sort_values('reading score',ascending=False).head()

                         reading score
test preparation course
completed                    74.175978
none                         66.417445

In [49]:
df[['test preparation course','writing score']].groupby('test preparation course').mean().sort_values('writing score',ascending=False).head()

                         writing score
test preparation course
completed                    74.684358
none                         64.457944

## 4. What do you think about the scoring variation for math, reading and writingbased on
#Gender

In [59]:
df[['gender','math score']].groupby('gender').var().sort_values('math score',ascending=False).head()

        math score
gender
female  256.958593
male    211.889097

In [60]:
df[['gender','reading score']].groupby('gender').var().sort_values('reading score',ascending=False).head()

        reading score
gender
female     207.677438
male       200.211010

In [61]:
df[['gender','writing score']].groupby('gender').var().sort_values('writing score',ascending=False).head()

        writing score
gender
female     220.369327
male       202.413924

## 4. What do you think about the scoring variation for math, reading and writingbased on
#test preparation course

In [62]:
df[['test preparation course','math score']].groupby('test preparation course').var().sort_values('math score',ascending=False).head()

                         math score
test preparation course
none                     246.668662
completed                210.884027

In [63]:
df[['test preparation course','reading score']].groupby('test preparation course').var().sort_values('reading score',ascending=False).head()

                         reading score
test preparation course
none                        213.419851
completed                   183.265864

In [64]:
df[['test preparation course','writing score']].groupby('test preparation course').var().sort_values('writing score',ascending=False).head()

                         writing score
test preparation course
none                        226.251739
completed                   175.202612

## 5. The management needs your help to give bonus points to the top 25% ofstudents based on their maths score, so how will you help the managementto achieve this.

In [26]:
df.nlargest(250,"math score")

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
515,female,group E,some college,standard,none,100,92,97
516,female,group E,bachelor's degree,standard,none,100,100,100
517,female,group E,associate's degree,standard,none,100,100,100
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
...,...,...,...,...,...,...,...,...
428,female,group D,some college,free/reduced,none,77,86,86
429,female,group E,some high school,standard,none,77,79,80
849,male,group A,bachelor's degree,standard,none,77,67,68
850,male,group C,associate's degree,free/reduced,none,77,67,64
851,male,group D,some college,standard,completed,77,62,62